DataProcessors/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ГрафикиРаботы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НормаЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГосНормаЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГосНормаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ГрафикиРаботы/Forms/Форма/Ext/Form/Module.bsl
//Демонстрация проблемы с незаполненным измерением сост. типа (Неопределено) при установке упр. блокировки по независимому регистру сведений
//В одном сеансе читаем данные по пустому измерению "ГрафикРаботы", в другом сеансе уже не можем записать данные ни по одному графику
//Использование пустого измерения в отборе при чтении - блокирует
&НаСервере
Процедура КомандаПрочитатьНаСервере()
	НачатьТранзакцию();
	НЗ = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	НЗ.Отбор.ГрафикРаботы.Установить(График);
	НЗ.Отбор.День.Установить(День);
	НЗ.Прочитать();
	Если НЗ.Количество() > 0 Тогда
		НормаЧасов = НЗ[0].НормаЧасов;
	КонецЕсли;
	ОтменитьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрочитать(Команда)
	КомандаПрочитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаЗаписатьНаСервере()
	НачатьТранзакцию();
	НЗ = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	НЗ.Отбор.ГрафикРаботы.Установить(График);
	НЗ.Отбор.День.Установить(День);
	НоваяЗапись = НЗ.Добавить();
	НоваяЗапись.ГрафикРаботы = График;
	НоваяЗапись.День = День;
	НоваяЗапись.НормаЧасов = НормаЧасов;
	НЗ.Записать();
	ОтменитьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	КомандаЗаписатьНаСервере();
КонецПроцедуры
